<a href="https://colab.research.google.com/github/glebmikha/sql-course/blob/main/sql_course_examples.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Заливка данных

https://stackoverflow.com/a/59429952/4527289

https://drive.google.com/file/d/118AJOWGal_oTgCqrp1q5_hKtvyx1jRXL/view?usp=sharing

In [ ]:
!gdown --id 1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
!mv _sqlite3.cpython-37m-x86_64-linux-gnu.so /usr/lib/python3.7/lib-dynload/
import os
os.kill(os.getpid(), 9)

Downloading...
From: https://drive.google.com/uc?id=1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
To: /content/_sqlite3.cpython-37m-x86_64-linux-gnu.so
6.33MB [00:00, 98.6MB/s]

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
import sqlite3

In [ ]:
sqlite3.sqlite_version

In [ ]:
con = sqlite3.connect('db')

https://drive.google.com/file/d/118AJOWGal_oTgCqrp1q5_hKtvyx1jRXL/view?usp=sharing

In [ ]:
!gdown --id 118AJOWGal_oTgCqrp1q5_hKtvyx1jRXL

In [ ]:
df = pd.read_csv('/content/german_credit_augmented.csv')

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')

In [ ]:
df.dtypes

In [ ]:
df.to_sql('german_credit',con,index=False,if_exists='replace')

# Select

## Псевдонимы

In [ ]:
def select(sql):
  return pd.read_sql(sql,con)

Лучше писать названия столбцов с псевдонимами, так как когда запрос разрастается, это приведет к проблемам, если не указывать имя или псевдоним таблицы. Можно явно указать название таблицы - это самый явный способ. У всех компаний стиль может отличаться. Для главной таблицы можно делать название псевдонима t. Псевдонимы можно придумывать по абревиатуре. Нужно избегать псевдонимов: t1, t2, t3. С ними будет потом очень тяжело, сложно искать ошибки, легко забыть порядок. То же самое касается: a, b, c. Либо полные имена, либо сокращения по инициалам.

In [ ]:
sql = '''select t.age, t.housing from german_credit t'''

Если мы умножаем значения столбца, то можно переименовать столбец с помощью as. Рекомендуется всегда писать as. Но когда мы пишет псевдоним для таблицы (алиас), то можно не использовать as. А если стоит as, то это речь идет о столбце. Тройные ковычки для того, чтобы можно было делать запрос на несколько строк. принято форматировать операторы большими буквами. это можно сделать с помощью https://sqlformat.org/

In [ ]:
sql = '''select t.age * 3 as age_mult3 from german_credit t'''

In [ ]:
sql = '''SELECT t.age * 3 AS age_mult3,
       t.housing
FROM german_credit AS t
'''

In [ ]:
select(sql)

## Манипуляции со столбцами

Селекс к таблице не только показывает поля, он может создавать и новые столбцы. можно складывать столбцы.  также вывести все стандартные столбцы таблицы t.*. И новые столбцы всегда перечисляем через запятую для удобства. Зааятая или отсуствие - распространенная ошибка. Можно также делить столбцы. При делении столбцов могут появиться нули в результирующем.  Когда в БД целое число делится на целое число, на выходе тоже целое число. Хотя мы ожидаем увидеть дробное. И лайфхак умножить на 1.0 один из столбцов (есть знаки после точки). И автоматически деление конвертнется в правильный тип.

In [ ]:

sql = '''select t.*, 
t.age * 3 as age_mult3,
t.age + t.credit_amount as age_plus_amount,
t.age * 1.0 / t.credit_amount as age_div_amount,

t.age as age_2


 from german_credit t'''

In [ ]:
select(sql)

## Where

In [ ]:
df.head()

Для того, чтобы посмотреть огромную таблицу и не упасть после запроса, нужно посмотреть маленький кусочек через limit.

In [ ]:
sql = '''select * from german_credit t limit 5'''

In [ ]:
select(sql)

Чаще всего селекты мы хотим ограничить по дате. И например взять только 2007 год. И чтобы понять, правильно ли работает sql запрос, лучше его писать по частям. Не надо писать много кода и потом запускать, лучше по частям. Чтобы написать условие, испольуется where, а  limit всегда идет в конце. 
И используется between для диапазона даты (ее указать в кавычках) и использовать and для построения диапазона.

In [ ]:
sql = '''select count(*) from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
'''

Но в реальной жизни 1 год - это большое количество строк. Поэтому в pandas это не получится сделать, все повиснет. И для этого используется count(*). Он считает количество строк в результирующей таблице.

In [ ]:
select(sql)

Здесь внутри count в заглушке можно использовать и 1. Он выдаст такой же результат.

In [ ]:
sql = '''select count(1) from german_credit t 
where t.contract_dt between '2007-01-01' and '2007-12-31'
'''

Когда берут по датам, то часто хотят эти данные упорядочить. И для этого используется order by. Возрастание по убыванию - desc. Можно упорядочить по нескольким столбцам. Сначала будет применена первая, затем вторая часть.
Условий в where можно быть несколько. их можно соединить and. 
С помощью -- можно комменировать строки, чтобы не выполнять их.

In [ ]:
sql = '''select * from german_credit t 
where t.contract_dt between '2007-01-01' and '2007-12-31'
-- and t.purpose = 'car'
and t.purpose in ('car' ,'repairs')

order by t.contract_dt desc, credit_amount 
'''

Еще в условии можно писать or, но с ним нужно быть осторожным. нужно поставить скобки, чтобы запрос вернул правильный результат. Сейчас вернется результат эквивалентный in. лучше использовать in и по возможности избегать or.

In [ ]:
sql = '''select * from german_credit t 
where t.contract_dt between '2007-01-01' and '2007-12-31'
-- and t.purpose = 'car'
and (t.purpose = 'car' or t.purpose = 'repairs')

order by t.contract_dt desc, credit_amount 
'''

In [ ]:
select(sql)

## Like

Иногда where не помогает с отбором строк. нужно сложнее условие.

In [ ]:
t = pd.DataFrame({'purpose':['машина','на машину','на покупку машины','автомобиль','на возвращение 2007'],
              'amount':[1000,400,600,700,1500]})

In [ ]:
t

In [ ]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from purpose t'''

In [ ]:
select(sql)

И нам нужно отобрать все строки, где цель - машина. Автомобиль сюда тоже попадает. Машина написана по разному, поэтому оператор like помогает составить запрос.

In [ ]:
sql = '''select * from purpose t
where t.purpose like '%машин%'
'''

In [ ]:
sql = '''select * from purpose t
where (t.purpose like '%машин%'
or t.purpose like '%авто%') and t.amount > 500
'''

In [ ]:
select(sql)

Еще в sql можно писать логику: if then. какие -то условия и по ним создавать переменные.
все поля с таблички t можно писать так вместо count(*) : 
t.*. потому что если мы используем join, то звезда будет означать все поля со всех таблиц.

In [ ]:
sql = '''select * from german_credit t'''

In [ ]:
select(sql)

И задача: посчитать долю клиентов, у которых размер кредита более 1000.

In [ ]:
sql = '''select count(*) from german_credit t
where t.credit_amount > 1000'''

In [ ]:
select(sql)

In [ ]:
884/1000

но можно сделать это умнее. можно написать расчетный столбец, в котором будет показано больше крелит чем 1000, или нет. и обычно такое кодируют с помощью 0 и 1 и используют case when. такое поле обычно называют флагом: 1- флаг поднят, 0 - опущен.

In [ ]:
sql = '''select t.credit_amount,
case when t.credit_amount > 1000 then 1 else 0 end as greater_1000_flag
from german_credit t'''

In [ ]:
select(sql)

еще такой флаг можно посчитать другим способом. это знакомо тем, кто пришел из эксель. там есть функция if. В SQLite3 она реализована с помощью iif.case then он сложнее, здесь может быть много условий и веток. но для простых кейсов можно использовать iif. но чаще используют все таки CASE THEN

In [ ]:
sql = '''select t.credit_amount,
case when t.credit_amount > 1000 then 1 else 0 end as greater_1000_flag,

iif(t.credit_amount > 1000,1,0) as greater_1000_flag2

 from german_credit t'''

In [ ]:
select(sql)

вернемся к задаче подсчета доли. и чтобы нам посчитать долю, нам нужно взять среднее по новому расчетному полю. среднее суммирует все значения и делит на количество. мы просуммируем все единицы, поделим на общее количество клиентов и получим долю тех, у кого кредит больше 1000. для подсчета среднего функция AVG.

In [ ]:
sql = '''select 
avg(case when t.credit_amount > 1000 then 1 else 0 end) as greater_1000_frac
 from german_credit t'''

In [ ]:
select(sql)

очень важно уметь писать сложные case when и мы научимся это делать супер-круто.

## Create table

иногда нужно сохранить результат селекта в отдельную таблицу, чтобы потом ее как-то использовать.

In [ ]:
sql = '''select * from german_credit t
where t.credit_amount > 1000'''

In [ ]:
select(sql)

и теперь мы хотим эту таблицу сохранить в отдельную таблицу в базе данных. у нас есть пока таблица german_credit и результат запроса в памяти. для этого нужно использовать курсок (cursor). потмоу что селект умеет только считывать эти данные. а нам нужно что-то создать в БД, поэтому создаем курсор:

In [ ]:
cur = con.cursor()

теперь мы берем наш запрос и дописываем сверху некоторую строку:

создай мне таблицу на основе этого запроса "create table greater_1000_credit as"

In [ ]:
sql = '''
drop table if exists greater_1000_credit;
create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000
'''

In [ ]:
cur.executescript(sql)

тут выдалась строка и это означает, что ошибки нет. 
теперь мы может селектнуть с этой таблицы:

In [ ]:
sql = '''select * from greater_1000_credit t'''

In [ ]:
select(sql)

в этой таблице лежат строки, где кредит больше 1000.
аналитики часто перезапускают свой код, и чтобы таблица нормально создалась заново, ее нужно перед началом дропнуть (если она существует) и поставить точку с запятой, так как это две команды.

In [ ]:
sql = '''
drop table if exists greater_1000_credit;
create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000'''

для того, чтобы сразу выполнить несколько команд:

In [ ]:
cur.executescript(sql)

это полезно когда мы делаем ежемесячный отчет и когда перезапускаем один и то же код.

In [ ]:
sql = '''select * from greater_1000_credit t'''

In [ ]:
select(sql)

## Create table postgres

создание таблицы в postgres. здесь немного по другому. и тут можно узнать, с какими можно столкнуться различиями при работе с другими  БД. 
возьмем нашу БД postgres которую создали на elephantSQL.

In [ ]:
from sqlalchemy import create_engine
con_pg = create_engine('postgresql+psycopg2://iqxlggwo:OjRfypqkY7g2B-r6iG57mhu2FxxqbH5e@hattie.db.elephantsql.com/iqxlggwo')

In [ ]:
def select_pg(sql):
  return pd.read_sql(sql,con_pg)

In [ ]:
sql = '''select * from german_credit t
where t.credit_amount > 1000'''

In [ ]:
select_pg(sql)

In [ ]:
sql = '''
drop table if exists greater_1000_credit;
create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000'''

а тут уже не нужно создавать курсор. он есть автоматически. и здесь может исполняться сразу несколько набор команд, здесь уже не нужен script

In [ ]:
con_pg.execute(sql)

табличка создалась и теперь ее можно селектить:

In [ ]:
sql = '''select * from greater_1000_credit t'''

In [ ]:
select_pg(sql)

## Union all

эта команда позволяет объединять таблички по вертикали. ставить их одну на другую.  создаем две таблички и заливаем их в БД под разными названиями

In [ ]:
jan = pd.DataFrame({'month':['jan','jan'],'revenue':[1,2]})
feb = pd.DataFrame({'month':['feb','feb'],'revenue':[1,2]})

In [ ]:
jan.to_sql('jan',con,index=False,if_exists='replace')
feb.to_sql('feb',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from jan t
union all
select * from feb t'''

In [ ]:
select(sql)

здесь важно, чтобы в каждом из запросов селект при объединении union all совпадало количество столбцов. 
еще есть такая штука как union. он используется редко. например, union all безопасный и он не удалит никакие строки. а union удалит дубликаты.

In [ ]:
sql = '''select t.revenue from jan t
union all
select t.revenue from feb t'''

In [ ]:
sql = '''select t.revenue from jan t
union
select t.revenue from feb t'''

In [ ]:
select(sql)

в итоге остались только уникальные элементы. 

Очень часто бывает такое, что знаешь, что в каждой из этих табличек хранится январь и февраль. но в нем не проставлены наименования месяца. и для того, что в итоговой таблице их как то различать, можно задардкодить этот столбец.

In [ ]:
sql = '''select t.revenue,
'jan' as month
 from jan t
union all
select t.revenue,
'mar' as month
 from feb t'''

In [ ]:
select(sql)

функцию union all мы будем применять в работе достаточно часто.

## Специальные функции

в sql есть много вспомогательных функций и запоминать их не надо, и учить специально тоже. нужно брать их тогда, когда в этом возникает потребность и учиться сразу на задаче. 

Задача: из поля sex взять первую букву. начинаем писать с конструкции селекта.

In [ ]:
sql = '''select * from german_credit t'''

и дальше нужно гуглить применитльно к той базе данных, в которой работаешь.

In [ ]:
sql = '''select t.sex, substr(t.sex,1,1) from german_credit t'''

In [ ]:
select(sql)

In [ ]:
sql = '''select t.sex,
substring(t.sex,1,1),

left(t.sex,1)

 from german_credit t'''

In [ ]:
select_pg(sql)

# Group by

## Сводная таблица

сводная таблица - это самое главное в анализе.
сначала мы пишем заглушку, затем дописываем запрос.
для того, чтобы посчитать количество мужчин и женщин, нужно создать новый столбец count(*), но он будет работать если мы применим агрегацию к столбцу t.sex и сгруппируем по группам male и female. нужно применить group by в конце запроса.

In [ ]:
sql = '''select t.sex,
count(*)
from german_credit t
group by t.sex
'''

In [ ]:
select(sql)

в pandas тоже легко делать сводную таблицу:

In [ ]:
df.groupby('sex')['credit_amount'].count()

теперь если мы хотим добавить еще один столбец со средним кредитом, то используем avg и называем столбец. средний кредит посчитается по сгруппированным заранее столбцам

In [ ]:
sql = '''
select 
t.sex,

count(*) as cnt,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by t.sex
 '''

In [ ]:
select(sql)

In [ ]:
df.groupby('sex')['credit_amount'].agg(['count','mean'])

всегда когда делаем сводник, используем count. важно знать размер каждой категории, обращать на нее внимание или нет. всегда когда хотим посчитать количество строк с пропусками, то ставим в count либо единицу, либо звезду.

для того, чтобы посчитать уникальные значения какого-ибо стллбца, используем distinct

In [ ]:
sql = '''select distinct t.housing from german_credit t'''

In [ ]:
select(sql)

для подсчета количество уникальных значений столбца используем связку count и distinct.
count(t.housing) тупо посчтает все строки столбца.

In [ ]:
sql = '''select count(distinct t.housing), count(t.housing) from german_credit t'''

In [ ]:
select(sql)

In [ ]:
sql = '''
select 
t.housing,

count(*) as cnt,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by t.housing
 '''

In [ ]:
select(sql)

## Пропуски

Когда мы просто считает количество строк в столбце, то используем count со звездочкой. Но в столбце могут быть пропуски. 
Если в нем пропуски, то count по столбцу посчитает все строки без пропусков.

In [ ]:
sql = '''select count(t.checking_account), count(0) from german_credit t'''

In [ ]:
select(sql)

На примере видно, что количество заполненных тсрок в тсолбце 606, вместо 1000. 

А что, если добавить checking_account в сводник.

In [ ]:
sql = '''
select 
t.checking_account,

count(*) as cnt,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by t.checking_account
 '''

Сводник учитывает пропуски и в отдельную категорию записывает None.

In [ ]:
select(sql)

в pandas по умолчанию сводник пропускает пропуски:

In [ ]:
df.groupby('checking_account')['credit_amount'].count()

после группировки данных всегда должно оставаться то же количество человек.для этго используем dropna=False

In [ ]:
df.groupby('checking_account',dropna=False)['credit_amount'].count()

Чаще нам хочется увидеть количество пропусков. Мы для необходимого поля checking_account может посчитать флаг, то есть сделать case when. Сделаем еще один столбец, в котором если None, то будет 1, а если заполнено, то 0. 
Конкретно в SQL нужно писать is null, чтобы составить условие, что строка пропущена.

In [ ]:
sql = '''select
t.checking_account,
case when t.checking_account is null then 1 else 0 end as in_null
from german_credit t'''

In [ ]:
select (sql)

и ч тобы посчитать количество пропусков, поле is_null можно просуммировать с помощью sum. count будет считать 0, и нолт для него это не пропуск. и чтобы ciunt не считал заполненные строки, нужно поставить в конце case when слово null. Он посчитает только единицы, null он не посчитает.

In [ ]:
sql = '''select 
sum(case when t.checking_account is null then 1 else 0 end) as is_null,

count(case when t.checking_account is null then 1 else null end) as is_null2

 from german_credit t'''

In [ ]:
select(sql)

In [ ]:
t = pd.DataFrame({'col1':[1,np.nan,2]})

In [ ]:
t

In [ ]:
t.to_sql('null_test',con,index=False,if_exists='replace')

и чтобы быстро проверить, учитывает ли count  NaN, можно создать табличку и проверить

In [ ]:
sql = '''select count(t.col1), count(1) from null_test t'''

In [ ]:
select(sql)

Count пропускает null  в SQL, NaN в pandas.

In [ ]:
t

In [ ]:
(1 + 2) / 3

In [ ]:
(1 + 0 + 2) / 3

In [ ]:
sql = '''select avg(t.col1) from null_test t'''

In [ ]:
select(sql)

Чтобы заполнить пропуски, используем coalesce.

In [ ]:
sql = '''select

t.checking_account,

coalesce(t.checking_account,'no_info')

 from german_credit t'''

In [ ]:
select(sql)

Мы захотим чаще всего, чтобы вместо пропуска NaN подставлялся ноль 0. И по этому полю теперь можно посчитать среднее, и оно уже будет учитывать ноль, что верно!

In [ ]:
sql = '''select avg(coalesce(t.col1,0)) from null_test t'''

In [ ]:
select(sql)

In [ ]:
t = pd.DataFrame({'col1':[1,np.nan,2],
                  'col2':[np.nan,np.nan,1],
                  'col3':[1,2,3]})

In [ ]:
t

In [ ]:
t.to_sql('null_test',con,index=False,if_exists='replace')

Представим, чтобы результирующий столбец был первым столбцом, в котором будут значения.

In [ ]:
sql = '''select t.*, coalesce(t.col1,t.col2,t.col3) from null_test t'''

In [ ]:
select(sql)

Если забылась какая-то функция, нужно создать игрушечный даатфрейм и на нем протестировать ее.

## Дубликаты

In [ ]:
t = pd.DataFrame({'id':[1,1,2],'name':['a','a','b']})

In [ ]:
t

In [ ]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from dupl_test t'''

In [ ]:
select(sql)

Мы наблюдаем два полных дубликата. Как нам найти такие строки? Это с помощтю group by, используя все наши столбцы.То есть мы должны сделать агрегацию по всем столбцам и посчитать количество таких строк с помощью count(1), создавая такой столбец.

In [ ]:
sql = '''select t.id, t.name, count(1) as cnt from dupl_test t
group by t.id, t.name
'''

In [ ]:
select(sql)

И часто мы хотим увидеть все строки, в которых количество дубликатов больше 1. И мы не можем использовать where для столбца count(1). SQL не даст этого сделать. Для того, чтобы выбрать строки по условию с функцией агрегации нужно использовать HAVING, который всегда пишется после GROUP BY.

In [ ]:
sql = '''select t.id, t.name, count(1) as cnt from dupl_test t
group by t.id, t.name
having cnt > 1
'''

In [ ]:
sql = '''select t.id, t.name, count(1) as cnt from dupl_test t
group by t.id, t.name
having count(1) > 1
'''

In [ ]:
select(sql)

In [ ]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [ ]:
t

In [ ]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from dupl_test t'''

In [ ]:
select(sql)

Мы наблюдаем, что здесь повторяются id. И это наиболее частая ситуация. а мы хотим уникальных клиентов, эти строки не должны повторяться. Поэтому в группировке нам нужно посчитать только id.

In [ ]:
sql = '''select t.id, count(1) as cnt from dupl_test t
group by t.id
having count(1) > 1
'''

In [ ]:
select(sql)

Мы нашли свои дубликаты. Но обычно такого не хватает, когда мы нашли только id повторяющиеся. Мы хотим посмотреть на остальные столбцы, которые связаны с этими столбцами.
Здесь мы можем сделать с помощью where, уже знаем наши повторяющиеся id.

In [ ]:
sql = '''select * from dupl_test t
where t.id in (1,2)'''

In [ ]:
select(sql)

И мы нашли строчки таблицы, где повторяются id.
Но нам нужно, чтоэто это считалось автоматически, потому что id может быть тысячи. На помощь приходит подзапрос.

In [ ]:
sql = '''select t.id as cnt from dupl_test t
group by t.id
having count(1) > 1
'''

In [ ]:
select(sql)

Модифицируем наш запрос с поиском повторяющихся id, Добавим его внутрь запроса всех строк, где условие будет where t.id in (...)
Сначала выполнится запрос в скобках, найдутся все id, которыен повторяются (берем только столбец с id), затем эти id подставим в запрос с уловием.

In [ ]:
sql = '''select * from dupl_test t
where t.id in (select t.id as cnt from dupl_test t
group by t.id
having count(1) > 1)'''

In [ ]:
select(sql)

Получили автоматически все строки таблицы, где id повторяются.

## Агрегация

Мы используем group by для того, чтобы представить данные для наиболее удобного формата. 

Представим, что мы хотим посчитать количество кредитов на каждый месяц. Для этого нужно получить месяц. Никогда не надо хранить дату в форме, отличной от даты. Не надо месяц вычленять как цифру 6 и хранить ее в int. Это приведет к ошибке. Потому что июнь есть как в 2008 г., так и в 2007 г. И если мы применим агрегацию, то они схлопнутся. Всегда хранить дату в формате даты. Если мы хотим взять год, можно взять первый день года. если месяц, то первый день месяца. В SQLite3 это можно сделать с помощью date().

In [ ]:
sql = '''select t.*, date(t.contract_dt, 'start of month') as month from german_credit t'''

In [ ]:
select(sql)

Получили столбец month с первым числом месяца. В каждой БД это будет по-разному. 
Теперь мы можем посчитать количество кредитов. Группируем по созданному столбцу месяцев, затем считает количество строк по каждому месяцу и записываем это в отдельный столбец. Иногда в group by не работает название агрегированного столбца. тогда нужно вставлять полностью код с date: group by date(t.contract_dt, 'start of month')

In [ ]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(1) as cnt
from german_credit t
group by month
'''

А можно в SQL заменить название столбца или код который его создал, на порядковый нормер столбца. и будет то же самое. Но это может вызвать некоторые ошибки и придется переделывать.

In [ ]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(1) as cnt
from german_credit t
group by 1
'''

добавим сортировку по столбцу month:

In [ ]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(1) as cnt
from german_credit t
group by date(t.contract_dt, 'start of month')
order by date(t.contract_dt, 'start of month')
'''

добавим столбец с суммой всех кредитов:

In [ ]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(1) as cnt,
sum(t.credit_amount) as credit_amount_sum
from german_credit t
group by date(t.contract_dt, 'start of month')
order by date(t.contract_dt, 'start of month')
'''

получилась сумма всех кредитов по месяцам.

посчитаем среднее:

In [ ]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(1) as cnt,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg
from german_credit t
group by date(t.contract_dt, 'start of month')
order by date(t.contract_dt, 'start of month')
'''

In [ ]:
select(sql)

Также мы можем посчитать количество уникальных клиентов по месяцам. Вдруг у нас клиенты повторяются. И для того, чтобы посчитать именно уникальные id клиентов, надо использовать count(distinct t.client_id)

In [ ]:
sql = '''select date(t.contract_dt,'start of month') as month,
count(1) as credit_cnt,
count(distinct t.client_id) as client_id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by date(t.contract_dt,'start of month')
 order by date(t.contract_dt,'start of month')
 '''

In [ ]:
select(sql)

Наблюдаем, что количество кредитов соотвествует количеству клиентов. 

Как это будет выглядеть, если клиенты не уникальные. Сделаем только 600 уникальных id. Для этого возьмем от 0 до 599 уникальных id, а после возьмем семлп 1000, где будут наши id за счет повторения replace=True. Из 600 разных id составим 1000 ращных чисел, где id повторяются.

In [ ]:
pd.Series(range(600)).sample(1000,replace=True)

сохраним столбец с новым набором id под именем client_id_2, добавим values, чтобы не перепутались индексы.

In [ ]:
 df['client_id_2'] = pd.Series(range(600)).sample(1000,replace=True).values

In [ ]:
df.to_sql('german_credit_not_unieque',con,index=False,if_exists='replace')

Теперь кинем запрос к новой таблице, используя новые id.

In [ ]:
sql = '''select 
date(t.contract_dt,'start of month') as month,
count(1) as credit_cnt,
count(distinct t.client_id_2) as client_id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg

 from german_credit_not_unieque t
 group by date(t.contract_dt,'start of month')
 order by date(t.contract_dt,'start of month')
 '''

In [ ]:
select(sql)

Количество уникальных клиентов меньше, чем всего кредитов. Один клиент берет несколько кредитов. Нам интересно количество действий, и количество уникальных клиентов.

## Интервалы (или бины или бакеты)

Мы научились группировать на категории, когда значений не очень много. научились группировать на даты. Но есть столбцы, которые имеют непрерывный хакактер и у них много уникальных значений.

In [ ]:
sql = '''select count(distinct t.credit_amount) from german_credit t'''

In [ ]:
select(sql)

Группировать на это не интересно, такая агрегация не дает много информации. Обычно такие данные столбцом мы хотим поделить на некоторые интервалы. Например. размер кредита от 0 до 1000, от 1000 до 2000 и тд. 
Используем оператор case when, где нам выведет столбец, и если креди меньше 1000, то напишем строку "1. < 1000", иначе other.

In [ ]:
sql = '''select t.credit_amount,
case when t.credit_amount < 1000 then '1. <1000' else 'other' end as credit_amount_bin
from german_credit t'''

теперь можно написать следующее условие:

In [ ]:
sql = '''select t.credit_amount,
case when t.credit_amount < 1000 then '1. <1000'
when t.credit_amount < 2000 then '2. 1000-2000'

else 'other' end as credit_amount_bin
from german_credit t'''

In [ ]:
sql = '''select t.credit_amount,
case when t.credit_amount < 1000 then '1. <1000'
when t.credit_amount < 2000 then '2. 1000-2000'
when t.credit_amount < 3000 then '3. 2000-3000'

else 'other' end as credit_amount_bin
from german_credit t'''

In [ ]:
select(sql)

в other сейчас входит все то, что не вошло в первые 3 условия. Поэтому мы сделаем так, что other теперь это от 3000 и выше. А если кредит отрицательный, то оставим other.

In [ ]:
sql = '''select t.credit_amount,

case when t.credit_amount < 1000 then '1. < 1000'
when t.credit_amount < 2000 then '2. 1000-2000' 
when t.credit_amount < 3000 then '3. 2000-3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin

 from german_credit t'''

Это обезопасит от неверных отрицательных или нетипичных значений.

In [ ]:
select(sql)

теперь можно посчитать количество кредитов в каждой из этих категорий. Группируем по вычисляемому полю, где различные категории, этот столбец будет первым. далее второй столбец это count(1)

In [ ]:
sql = '''select 

case 
when t.credit_amount < 1000 then '1. <1000'
when t.credit_amount < 2000 then '2. 1000-2000' 
when t.credit_amount < 3000 then '3. 2000-3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin,

count(1) as credit_cnt

 from german_credit t
 group by 1
 '''

в зависимости от БД, в group by мы можем поставить либо номер столбца, либо название столбца, либо же явно указать всю конструкцию case when для того, чтобы работало во всех БД.

In [ ]:
select(sql)

## Столбцы сводной таблицы

В классической сводной таблице можно добавлять переменные в столбцы. В некоторых БД это сделано автоматически с помощью pivot_table. Но это нужно уметь делать и руками.

In [ ]:
sql = '''select t.housing,
count(1) as cnt
from german_credit t
group by t.housing
'''

Теперь нужно разбить  это по полу, по полю sex.
для этого используем case then. 
count также будет применяться ко всем строчкам, но в тех строчках, где у меня не female, будет null, а count пропускает null. И такми образом он посчитает только женщин. то же самое для male.

In [ ]:
sql = '''select t.housing,
count(case when t.sex = 'female' then 1 else null end) as female,
count(case when t.sex = 'male' then 1 else null end) as male,
count(1) as cnt
from german_credit t
group by t.housing
'''

In [ ]:
select(sql)

In [ ]:
sql = '''select t.housing, 

count(case when t.sex = 'female' then 1 else null end) as female,
count(case when t.sex = 'male' then 1 else null end) as male,

count(1) as cnt 

from german_credit t
group  by t.housing'''

In [ ]:
select(sql)

но мы работает в python, и это можно автоматизировать. Ведь в столбце sex всего 2 категории, а если их больше, то копировать вручную уже не удобно.

Для начала найдем все уникальные категории, например, для столбца purpose:

In [ ]:
sql = '''select distinct t.purpose from german_credit t'''

In [ ]:
select(sql)

сохраним результаты запроса в python список:

In [ ]:
purpose = list(select(sql)['purpose'].values)

In [ ]:
purpose

теперь будем конструировать строку. Мы можем в цикле по ним пройтись и сгенерировать строку для каждого из них.

In [ ]:
for p in purpose:
  print(f"count(case when t.purpose = '{p}' then 1 else null end) as {p.lower().replace(' ','').replace('/','')},")

копируем этот код и вставляем в запрос:

In [ ]:
sql = '''select t.housing, 

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,
count(1) as cnt 

from german_credit t
group  by t.housing'''

In [ ]:
select(sql)

Мы получили сводную таблицу, и столбцы мы сгенерировали с помощью питона. SQL  в питоне писать очень эффективно.

## Категории из текстовых данных

Бывает что переменные, точнее данные столбца заполнены в свободной форме в виде текста, и нам нужно их категоризовать. например, цель кредита. Такая задача вручную решается очень хорошо. 
Сделаем таблицу и зальев ее в SQL.

In [ ]:
t = pd.DataFrame({'purpose':['машина','машина','машина','на машину','на покупку машины',
                             'автомобиль','на возвращение 2007', 
                             'на свадьбу','свадьба','свадьба','свадьба','для свадьбы',
                             'недвижимость','на покупку недвижимости']})

In [ ]:
t

In [ ]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [ ]:
df.head()

In [ ]:
sql = '''select * from purpose t'''

In [ ]:
select(sql)

И первое, что нужно сделать, это среди смешанных данных, найти то, что встречается чаще всего. Сделаем count(1) по каждым из этих слов, вдруг что-то повторяется. И сделаем по убыванию, чтобы наверху были самые часто встречающиеся значения.

In [ ]:
sql = '''select t.purpose,
count(1) from purpose t
group by t.purpose
order by count(1) desc
'''

In [ ]:
select(sql)

С помощью LIKE мы найдем все виды слов и выражений по корню слова. Пока делаем отдельную категорию для свадьбы,а все остальное - в другое.

In [ ]:
sql = '''select t.purpose,
case when t.purpose like '%свадьб%' then 'свадьба'
else 'другое' end as purpose_cat
from purpose t'''

Но в реальной жизни мы глазами можем и не увидеть. Поэтому мы сделаем count(1), чтобы посмотреть количество по выделенной категории.

In [ ]:
sql = '''select
case when t.purpose like '%свадьб%' then 'свадьба'
else 'другое' end as purpose_cat,
count(1) 
from purpose t
group by purpose_cat'''

In [ ]:
select(sql)

In [ ]:
sql = '''select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'

else 'другое' end as purpose_cat

from purpose t'''

In [ ]:
select(sql)

И теперь мы начинаем работать иттерациями, и смотрим категорию "другое" и смотрим снова самое частое значение. И для этого нам нужно взять уже размеченные данные, где есть эта категория "другое". 
Копируем запрос: sql = '''select t.purpose,
count(1) from purpose t
group by t.purpose
order by count(1) desc
'''
И теперь вместо селекса из оригинальной таблички purpose, сделаем селект из таблички, у которой есть столбец purpose_cut. Здесь будет добавлена таблица, где есть расчетное purpose_cut.

Дальше сделаем count по всему, что относится к категории "другое".

In [ ]:
sql = '''select t.purpose, count(1)

from (select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'

else 'другое' end as purpose_cat

from purpose t) t
where t.purpose_cat = 'другое'

group by t.purpose
order by count(1) desc
'''

In [ ]:
select(sql)

теперь мы видим, что машина вышла на первое место. добавляем машину в like:

In [ ]:
sql = '''select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'

else 'другое' end as purpose_cat

from purpose t'''

In [ ]:
select(sql)

In [ ]:
cat = '''select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

In [ ]:
select(cat)

Назовем запрос cat. и дальше, чтобы не копипастить when, то можно подставить таблицу cat вместто таблицы purpose. Можно воспользоваться f-стрингом. Позволяет в строку подставлять другие переменные.

In [ ]:
sql = f'''select 
t.purpose_cat,

count(1)

 from ({cat}) t
 group by t.purpose_cat'''

In [ ]:
select(sql)

In [ ]:
sql = f'''select t.purpose, count(1) 

from ({cat}) t
where t.purpose_cat = 'другое'


group by t.purpose

order by count(1) desc'''

In [ ]:
select(sql)

вот такой техникой можно раскидать эту проблему.

# Подзапросы

## Обычный подзапрос

In [ ]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [ ]:
t

In [ ]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from dupl_test t'''

In [ ]:
select(sql)

найдем id, которые повторяются:

In [ ]:
sql = '''select t.id,
count(1)
from dupl_test t
group by t.id'''

In [ ]:
select(sql)

а теперь возьмем id, которые повторяются более 1 раза, чтобы найди все дубликаты id. но функцию агрегации count нельзя использовать с where, нужно having. при этом мы можем удаить столбец count(1), и он сам посчитается в having.

In [ ]:
sql = '''select t.id from dupl_test t
group by t.id
having count(1) > 1'''

In [ ]:
select(sql)

теперь мы хотим вывести все строки, в котрых id повторяются, чтобы понять, в чем проблема. и тут как раз используется подзапрос. id во вложенном запросе автоматически выведутся, а их мы внесем во внешний запрос для вывода всех строк, мы эти id используем в условии **where t.id in (...)**:

In [ ]:
sql = '''select * from dupl_test t
where t.id in (select t.id from dupl_test t
group by t.id
having count(1) > 1)'''

In [ ]:
select(sql)

подзапрос создает временную таблицу в памяти, котооая потом уходит. Но иногда даже хорошо сделать промежуточную таблицу, так как подзапросы разрастаются и в них можно не найти ошибку. это делается с помощью create table, drop table if exists используется когда таблица уже создаана и нам нужно перезапустить код

In [ ]:
sql = '''
drop table if exists dupls;
create table dupls as
select t.id from dupl_test t
group by t.id
having count(1) > 1'''

создаем таблицу

In [ ]:
cur.executescript(sql)

In [ ]:
sql = '''select * from dupls t'''

In [ ]:
select(sql)

теперь мы может вместо подзапроса вставить таблицу с нашими id, которые повторяются, чтобы найти все строки

In [ ]:
sql = '''select * from dupl_test t
where t.id in dupls'''

In [ ]:
select(sql)

таким образом, мы можем создавать промежуточные таблицы и их потом удалять, чтобы они не захламляли БД.

мы можем спокойно использовать where, если у нас в памяти есть таблица айдишников, которую мы сами создали (если мы вдруг забыли про having). В подзапросе обязательно создаем псевдоним t.

In [ ]:
sql = '''
select * from 

(select t.id,count(1) as cnt from dupl_test t
group by t.id) t

where t.cnt > 1
'''

In [ ]:
select(sql)

с помощью подзапросов можно создавать промежуточные вычисления.

## CTE (with)

бывает так, что мы забыли, что в where можно использовать and. и мы написали еще один запрос, и вложили в него то, что нам нужно, используя еще одно условие. и нам нужно искать самый глубокий подзапрос. Это очень неудобно. если там больше 1 подзапроса, то читать невозможно. Поэтому придумали CTE.

In [ ]:
sql = '''
select * from (

select * from 

(select t.id,count(1) as cnt from dupl_test t
group by t.id) t

where t.cnt > 1) t

where t.id = 1
'''

In [ ]:
select(sql)

перепишем запрос на with. сначала возьмем самый глубокий запрос.

и мы хотим, чтобы был доступ к этой табличке, как-будто она создана. и вместо подзапроса можно воспользоваться with. называем таблицу id_cnt. и после того, как закрыли скобку, можно писать селект. а дальше можно написать условие where.

In [ ]:
sql = '''
with id_cnt as (
select t.id,count(1) as cnt from dupl_test t
group by t.id)

select * from id_cnt t
where t.cnt > 1
'''

In [ ]:
select(sql)

и мы получаем результат, который нужен. Теперь мы хотим работать с этой таблицей, как-будто она уже создана в БД:

In [ ]:
sql = '''
with id_cnt as (
select t.id,count(1) as cnt from dupl_test t
group by t.id),

id_cnt_2 as

(select * from id_cnt t
where t.cnt > 1)

select * from id_cnt_2 t
where t.id = 1

'''

In [ ]:
select(sql)

Логика очень упростилась. Сначала создается таблица, в которой count сгруппированных id (количество повторов id), затем создается следующая таблица, она основана на предыдущей таблице, при этом она фильтрует, где count > 1. В следущем действии мы выбираем, где id = 1. **Pекомендуется вместо подзапросов использовать CTE.**
Кстати, в финальном селекте можно обращаться к любой таблице в базе данных (select * from **id_cnt_2** t
where t.id = 1). данный селект абсолютно независим.

In [ ]:
sql = f'''select 
t.purpose_cat,

count(1)

 from ({cat}) t
 group by t.purpose_cat'''

In [ ]:
print(sql)

Мы можем данный запрос с категориями переписать на with. сначала делаем таблицу categories, где будут наши категории кредитов. после из этой таблицы мы селектнем столбец purpose_cat и сформируем в отдельный столбец количество кредитов в каждой категории, группируя по purpose_cat.

In [ ]:
sql = '''
with categories as (
select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t)
 
 select t.purpose_cat,

count(1) from categories t
group by t.purpose_cat
'''

In [ ]:
select(sql)

Код стал более читаемый. With это хорошая вещь для агрегации.

## Когда лучше создавать таблицы

Иногда удобнее создать таблицу в БД, нежели чем использовать подзапросы или with. как раз случай с раскидыванием категории является таким примером. 

Берем запрос cat и создаем из него таблицу categories, предварительно написав строчку drop table (на случай перезапуска кода).

In [ ]:
sql = '''
drop table if exists categories;
create table categories as
select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

создаем таблицу:

In [ ]:
cur.executescript(sql)

можем что-то запросить из новой таблицы:

In [ ]:
sql = '''select * from categories t'''

In [ ]:
select(sql)

In [ ]:
sql = '''select 
t.purpose_cat,
count(1)

from categories t
group by t.purpose_cat'''

In [ ]:
select(sql)

In [ ]:
sql = '''select t.purpose,
count(1) 

from categories t
where t.purpose_cat = 'другое'

group by t.purpose
order by count(1) desc'''

In [ ]:
select(sql)

In [ ]:
sql = '''
with categories as (
select 1

from purpose t)
 
select * from categories t
'''

In [ ]:
select(sql)

# Джойны

## Лефт и иннер джоин

Это самое важное в sql. все таблицы связаны между собой по ключам, мы можем их соединять. В реальной жизни таблицы как german_credit не бывает, ее нужно собирать по частям. Информация разбросана по БД. 

Понять, как соединяются таблицы проще всего на примере excel.

In [ ]:
sql = '''select * from german_credit t limit 5'''

In [ ]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [ ]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion']})

In [ ]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [ ]:
items = pd.DataFrame({'user_id':[1,3],'item_name':['hleb','gold'],'value':[5,100]})

In [ ]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100

In [ ]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from users t'''

In [ ]:
select(sql)

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

хотим подтянуть все предметы, которыми владеет каждый из персонажей. Для этого использует join. Самый основной join - LEFT JOIN. Он самый безопасный, в резульатте ничего не пропадет.

Мы говорим, по какому условию мы должны взять 2 таблицы (on). Их id должны совпадать.

In [ ]:
sql = '''select * from users t
left join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id      name  user_id item_name  value
0   1      gleb      1.0      hleb    5.0
1   2  jon snow      NaN      None    NaN
2   3    tyrion      3.0      gold  100.0

Запрашиваем все столбцы из таблицы users  и столбец item_name из items.

In [ ]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id      name item_name
0   1      gleb      hleb
1   2  jon snow      None
2   3    tyrion      gold

еще есть второй джоин - inner join. в результате inner join потерялась одна строка с jon snow, потому что в столбце item_name есть пропуск. То есть остались только те строки, где во второй таблице что-то нашлось (таблица, которую мы приджоинили).Строк стало меньше чем в оригинальной таблице.

In [ ]:
sql = '''select t.*, i.item_name from users t
inner join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold

можно имитировать inner join с помощью left join: то есть вывести те строки, в которых нет None (is not null), а именно в таблице items, потому что мы приджоинили ее столбец item_name.

In [ ]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id
where i.item_name is not null
'''

In [ ]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold

Вообще по сути, можно использовать только left join и inner join. Все остальные диаграммы венна нужно только для прохождения интервью А для решения жизненных задач только left и inner.

Главное отличие настоящего join от ненастоящего join - это то, как он будет вести себя с дубликатами. Добавим еще один предмет для tyrion.

In [ ]:
items = pd.DataFrame({'user_id':[1,3,3],'item_name':['hleb','gold','wine'],'value':[5,100,20]})

In [ ]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20

In [ ]:
items.to_sql('items',con,index=False,if_exists='replace')

Теперь у нас для tyrion в таблице items лежит 2 предмета. То есть id по нему повторяется, дублится.

In [ ]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id      name item_name
0   1      gleb      hleb
1   2  jon snow      None
2   3    tyrion      gold
3   3    tyrion      wine

Теперь строк стало больше в результате добавления строки в items и применения left join. и он показал все строки, даже у которых дублируется id.

вместо inner join можно писать просто join и выведется только что, где нет пропусков в столбцах той таблицы, которую мы присоединили.

In [ ]:
sql = '''select t.*, i.item_name, i.user_id from users t
join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id    name item_name  user_id
0   1    gleb      hleb        1
1   3  tyrion      gold        3
2   3  tyrion      wine        3

в результате даже inner join могут появиться дубликаты. поэтому надо следить за результатами join. не теряется ли уникальность строки, если она нужна. 

left оставляет все  строки левой таблицы. inner оставляет строки, по которым где нашлись совпадения и в правой и в левой таблице.

In [ ]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
left join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id      name item_name  value  user_id
0   1      gleb      hleb    5.0      1.0
1   2  jon snow      None    NaN      NaN
2   3    tyrion      gold  100.0      3.0
3   3    tyrion      wine   20.0      3.0

In [ ]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id
where i.item_name is not null
'''

In [ ]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold
2   3  tyrion      wine

## Агрегируй перед тем как джойнить

о том, к каким ошибкам могут привести дубликаты в результаты join.

Создаем новую таблицу по персонажам и их количество побед.

In [ ]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion'],
                      'victory':[2,10,1]})

In [ ]:
users.to_sql('users',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
left join items i on t.id = i.user_id
'''

к примеру, аналитик имеет уже какую-то заготовку отчета, где есть показатель. и он приджоинивает табличку, и думает, что дубликатов там не появится. и не проверяет таблицу. и дальше ему нужно посчитать сумму побед.

In [ ]:
t = select(sql)

In [ ]:
t

   id      name  victory item_name  value  user_id
0   1      gleb        2      hleb    5.0      1.0
1   2  jon snow       10      None    NaN      NaN
2   3    tyrion        1      gold  100.0      3.0
3   3    tyrion        1      wine   20.0      3.0

посчитаем сумму по победам с помощью pandas.

In [ ]:
t['victory'].sum()

14

а если мы сейчас сделаем запрос к оригинальным данным

In [ ]:
sql = '''select sum(t.victory) from users t'''

In [ ]:
select(sql)

   sum(t.victory)
0              13

то получаем 13 побед, из-за того, что задублилась запись по tyrion, и у нас появилась дополнительная неправильная победа. у нас появился двойной счет. это очень распространенная ошибка.

1. всегда проверять контрольную сумму до и после джоина
2. проверять на дубликаты

то же самое происходит, когда мы используем inner join.

In [ ]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
join items i on t.id = i.user_id
'''

In [ ]:
select(sql)

   id    name  victory item_name  value  user_id
0   1    gleb        2      hleb      5        1
1   3  tyrion        1      gold    100        3
2   3  tyrion        1      wine     20        3

здесь оставнется всего 4 победы, потому что jon вообще исключен, он не вошел бы в сумму. и мы потеряли целых 10 побед. такое постоянно случается, когда в отчетах не сходятся цифры.

Поэтому, **всегда проверять тоталы!!!**

как правильно поступать в такой ситуации...

можно было бы добавить количество предметов у персонажей и их суммарную стоимость. и тут тоже могут быть ошибки. и здесь нужно агрегировать. но важно понять, на что ты будешь агрегировать.

In [ ]:
sql = '''select t.id, t.name,
sum(t.victory) as victory_sum,
count(i.item_name) as item_cnt,
sum(i.value) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name
'''

In [ ]:
select(sql)

   id      name  victory_sum  item_cnt  value_sum
0   1      gleb            2         1        5.0
1   2  jon snow           10         0        NaN
2   3    tyrion            2         2      120.0

опять получилась ошибка, под tyrion получилось 2 победы.

и мы понимаем, что столбцы из первой таблицы дублиться не должны. поэтому мы группируем по всем столбцам, включая victory:

In [ ]:
sql = '''select t.id, t.name,
t.victory,
count(i.item_name) as item_cnt,
sum(i.value) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name, t.victory
'''

In [ ]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1        5.0
1   2  jon snow       10         0        NaN
2   3    tyrion        1         2      120.0

получаем в сумме 13 побед, как и предполагалось. 

для щамены NaN на 0, применим coalesce:

In [ ]:
sql = '''select t.id, t.name, 
t.victory,
count(i.item_name) as item_cnt,
coalesce(sum(i.value),0) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name, t.victory
'''

In [ ]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

казалось бы, что все хорошо, но вот так делать не нужно.

**Здесь есть хорошее правило: агрегируй данные перед тем как джоинить.**

То есть перед тем как джоинить таблицу items, ее уже нужно сагрегировать на user'a.  поскольку мы видим, что юзеры повторяются,

In [ ]:
sql = '''select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum
from items t
group by t.user_id'''

In [ ]:
select(sql)

   user_id  item_cnt  value_sum
0        1         1          5
1        3         2        120

теперь у нас в таблице уникальные юзеры. они не могут повторяться, так как мы на них агрегируем. и именно эту таблицу нужно джоинить к users.

И джоинить ее будет с помощью CTE. 
копируем весь подзапрос. и делаем из него таблицу items_agg, затем проверяем с помощью проверочного селекта select * from items_agg t (потом его удаляем). 

А дальше делаем запрос нашей таблицы users и джоиним к ней нашу таблицу-заготовку items_agg. а дальше запрашиваем нужные столбцы id, name, victory, item_cnt, value_sum. Но при этом мы заменяем NaN на ноль.

In [ ]:
sql = '''
with items_agg as (

select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name,
t.victory,

coalesce(i.item_cnt,0) as item_cnt,
coalesce(i.value_sum,0) as value_sum

from users t

left join items_agg i on t.id = i.user_id

'''

In [ ]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

этот подход позволяет обезопасить себя. потому что перед join мы уже убедились, что и в первой таблице посчитано на юзеров, и сгруппировали мы на юзеров.  то есть мы джоиним юзера с юзером, а не юзера с item. так логики в запросах будет больше. не позволяет не допустить множества ошибок.

## Как не надо писать джойны

например, мы взяли предыдущий запрос, и убрали псевдонимы таблиц у столбцов. и оно все равно будет работать.

In [ ]:
sql = '''
with items_agg as (

select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name,
t.victory,

coalesce(item_cnt,0) as item_cnt,
coalesce(value_sum,0) as value_sum

from users t

left join items_agg i on t.id = i.user_id

'''

In [ ]:
select(sql)

**Но так нельзя писать!!! Особенно когда есть джоины.** 
Потому что когда мы читаем код, мы не понимаем откуда берется стобец, тут две таблицы. также он может выдать ошибку. голые столбцы вяглядят непрофессионально. приучить себя, даже если мы используем одну таблицу. это хорошая привычка, которая сэкономит много нервов. 

sql может выдать ошибку, если мы не используем псевдонимы. 

пересоздадим таблицу items, чтобы user_id назывался также как и id  в users.

In [ ]:
items = pd.DataFrame({'id':[1,3,3],'item_name':['hleb','gold','wine'],'value':[5,100,20]})

In [ ]:
items.to_sql('items2',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from users t
left join items i on t.id = i.user_id'''

In [ ]:
select(sql)

если напсиать id=id , то выдаст ошибку!!! sql не может понять, из какой таблицы нужно взять:

In [ ]:
sql = '''select * from users t
left join items2 i on t.id=i.id
'''

In [ ]:
select(sql)

джоинить еще можно с помощью using. в using можно передать тот столбец, который совпадает у таблиц и по нему произойдет джоин.

In [ ]:
sql = '''select * from users
left join items2 using(id)
'''

In [ ]:
select(sql)

и хоть такая возможность есть - использовать using - его используют крайне редко. лучше его никогда не использовать. это создаст лишние вопросы. 

бывает еще один тип джоинов в sql. он встречается все реже и реже.

In [ ]:
sql = '''select * from 
users t, items2 i 
where t.id = i.id
'''

In [ ]:
select(sql)

такое можно встретить в старых учебниках, в старых источниках. но так уже никто не пишет. и лучше так не писать!!!

## Никогда не используй right join!

главный бич человечества.

In [ ]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion']})

In [ ]:
users

In [ ]:
items = pd.DataFrame({'user_id':[1,3,3,4],'item_name':['hleb','gold','wine','sword'],'value':[5,100,20,50]})

In [ ]:
items

In [ ]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id'''

In [ ]:
select(sql)

остались все строки из левой таблицы, и все, что нашлось из правой.

А что если мы присоединим к items таблицу users наоборот?

In [ ]:
sql = '''select t.*, u.* from items t
left join users u on t.user_id = u.id'''

In [ ]:
select(sql)

теперь остались все строки с левой таблицы items.

и right join позволяет получить такое поведение замены табличек местами, когда по факту мы их не меняем местами. но так лучше не делать. он ставит всю логику с ног на голову. гораздо проще работать в одной логике, что мы всегда используем left join, либо inner.

**Никогда не писать right join среди left join. И вообще просто забыть про right join.**

и вообще right join  в sqlite3 отсуствует.

In [ ]:
sql = '''select t.*, i.* from users t
right join items i on t.id = i.user_id'''

продемонстрируем работу right join в postgres.

ускоритель заливки:

In [ ]:
import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [ ]:
users.to_sql('users',con_pg,index=False,if_exists='replace',method=psql_insert_copy)
items.to_sql('items',con_pg,index=False,if_exists='replace',method=psql_insert_copy)

In [ ]:
sql = '''select t.*, i.* from users t
right join items i on t.id = i.user_id'''

In [ ]:
select_pg(sql)

из таблицы users по id =4 ничего не нашлось, а аткже строка с id=2 тоже исчезла.

## Full join

он оставляет все строки из левой таблицы, и ивсе строки из правой таблицы. он реализован в postgres.

In [ ]:
sql = '''select t.*, i.* from users t
full join items i on t.id = i.user_id'''

In [ ]:
select_pg(sql)

остались все id из левой и правой таблицы user_id. full join есть не во всех БД, в SQLite3 его нет. 

его можно сыметировать. он состоит из запроса left join и right join, за исключением дубликатов. и это можно сделать с помощью union, который убирает дубликаты. а right join можно заменить left join со сменой мест.

Если вдруг не можешь вспомнить как делать full join (да и вообще что либо) -- всегда гугли. https://stackoverflow.com/questions/1923259/full-outer-join-with-sqlite

In [ ]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id
union 
select u.*, t.* from items t
left join users u on t.user_id = u.id
'''

In [ ]:
select(sql)

   id      name  victory  user_id item_name  value
0   1      gleb        2      1.0      hleb    5.0
1   2  jon snow       10      NaN      None    NaN
2   3    tyrion        1      3.0      gold  100.0
3   3    tyrion        1      3.0      wine   20.0

мы получили то, что было бы full join. full join можно избегать, он тоже может искажать логику.

## Inner join

Фишки, которые можно применить с inner join. Например, в таблице german_credit это данные по клиентам. Часто бывает в жизни, что в БД есть много информации по клиентам, собранные витрины. И нам присылают еще выборку клиентов и на них что-то расчитано. и нужно эти две выборки сопоставить. Поэтому эту таблицу с id клиентов можно залить в БД и отобрать строки из нашей БД, где client_id = id из присланной таблицы.

А если в этой таблице есть еще какая-то инфа, то их можно inner join и тогда только те клиенты, которые есть в выборке, которую тебе прислали.

In [ ]:
sql = '''select * from german_credit t limit 5'''

In [ ]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

представим, что нам прислали двух клиентов и по ним нужно что-то посмотреть.

In [ ]:
clients = pd.DataFrame({'client_id':[200,45],'data':[1,2]})

зальем их в БД:

In [ ]:
clients.to_sql('clients_task_name',con,index=False,if_exists='replace')

И теперь, чтобы зафильтровать, мы скопируем запрос по нашей таблице и сделаем inner join.

In [ ]:
sql = '''select t.*, ctn.data from german_credit t 
join clients_task_name ctn on t.client_id = ctn.client_id
'''

In [ ]:
select(sql)

   age     sex  job housing  ... default          contract_dt  client_id  data
0   52    male    2     own  ...       0  2008-04-27 08:23:07        200     1
1   35  female    3     own  ...       0  2007-05-06 10:58:22         45     2

[2 rows x 13 columns]

и дальше по этой таблицу можно построить сводники и построить отчет, который меня попросили. 

Еще inner join используется для генерации заготовок под отчет. И здесб удобно например посчитать отчет по месяцам или по дням. И здесь нужно сгенерировать на каждого юзера все возможные месяца, а затем к этой заготовке уже джоинить. она делается с помощью cross join.

Для разнообразия мы сгенерируем данные не в питоне, а в sql.

In [ ]:
sql = '''select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id'''

In [ ]:
select(sql)

   user_id
0        1
1        2
2        3

допустим нам нужно сгенеить отчет на 2 месяца. здесь хорошо два месяца явно указать.

In [ ]:
sql = '''select date('2021-03-01') as month
union all
select date('2021-04-01') as month
'''

In [ ]:
select(sql)

        month
0  2021-03-01
1  2021-04-01

теперь у нас есть табличка и с месяцами. теперь мы хотим сделать загововку, чтобы на каждого юзера был каждый месяц. сделаем таблицу, которую мы будет потом заполнять. нам нужно джоинить все строки таблицы user_id со всеми строками таблицы month. у каждого юзера будет и март, и апрель. 

С помощью with сделаем первую табличку, затем вторую (просто скопировать предыдущий код), а затем их сджоинить.
1=1 это условие, которое будет выполняться к каждой строке.

In [ ]:
sql = '''
with users as (
select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id),

month as
(select date('2021-03-01') as month
union all
select date('2021-04-01') as month)

select * from users t
join month m on 1=1
'''

In [ ]:
select(sql)

   user_id       month
0        1  2021-03-01
1        2  2021-03-01
2        3  2021-03-01
3        1  2021-04-01
4        2  2021-04-01
5        3  2021-04-01

это и есть cross join. но тут принято использовать inner join (join). 

И можно задать вопрос: сколько максимально может получиться строк в резульаты джоина двух таблиц. В одной 3 строки, во второй 2 строки. Ответ: 6. каждая строка джоинится с каждой **m*n**.

## Ежемесячный отчет

Практический пример. Раз у нас банк, мы сгенерировали банковские транзакции в таблице по ссылке.

In [ ]:
sql = '''select * from german_credit t limit 5'''

In [ ]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

https://drive.google.com/file/d/16q498Nap4RyR2OUarEI8RJHtPe4jERB-/view?usp=sharing

In [ ]:
! gdown --id 16q498Nap4RyR2OUarEI8RJHtPe4jERB-

Downloading...
From: https://drive.google.com/uc?id=16q498Nap4RyR2OUarEI8RJHtPe4jERB-
To: /content/german_credit_augmented_transactions.csv
100% 134k/134k [00:00<00:00, 39.1MB/s]

In [ ]:
transactions = pd.read_csv('/content/german_credit_augmented_transactions.csv')

Дата транзакции, id клиента, размер транзакции по карте.

In [ ]:
transactions.head()

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

Дали задание: сколько в меясц делается транзакций и сколько тратится денег.

In [ ]:
transactions.to_sql('client_transactions',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from client_transactions t limit 5'''

In [ ]:
select(sql)

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

посмотрим, сколько транзакйий:

In [ ]:
sql = '''select count(*) from client_transactions t limit 5'''

In [ ]:
select(sql)

   count(*)
0      4275

дальше пишем group by и мы знаем, что нам надо сделать на каждый месяц. нам нужно из даты как-то достать месяц. Даты всегда остается датой, берем первый день месяца.

In [ ]:
sql ='''select t.*, 
date(t.dt, 'start of month') as month 
from client_transactions t limit 5'''

In [ ]:
select(sql)

                    dt  client_id  amount       month
0  2008-04-06 11:54:47        950  161.38  2008-04-01
1  2007-07-28 00:00:19        418   35.34  2007-07-01
2  2008-03-14 20:43:54        131  146.50  2008-03-01
3  2007-12-18 13:03:24        353  119.21  2007-12-01
4  2007-11-09 05:18:30        849  105.24  2007-11-01

теперь можно писать group by на поле с датой, которое мы вычислили.

In [ ]:
sql = '''select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1
order by 1
'''

In [ ]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-10-01              332   634846.49
5   2007-11-01              389   500420.98
6   2007-12-01              364   561449.89
7   2008-01-01              413   630137.22
8   2008-02-01              228   337043.47
9   2008-03-01              309   425599.09
10  2008-04-01              383   677194.97
11  2008-05-01              310   474962.34
12  2008-06-01              271   383710.84

И вроде бы мы сделали, но если посмотрим внимательно, но в 2007 году нет сентября. Мы бы хотели увидеть, что в сентябре по столбцам transaction_cnt	amount_sum нули, так как это важная информация. И если мы сейчас посчитаем среднее, то сентябрь никак не учтется. 

Такие ещемесячные отчеты нужно начинать с генерации всех месяцев, которые нужно посчитать. И уже потом приджоинить таблицу. 

Сгенерировать даты можно и вручную. Но можно сделать в sql. Сгенерировать диспазон дат.

In [ ]:
min = '''select date(min(t.dt),'start of month') from client_transactions t'''

In [ ]:
select(min)

  date(min(t.dt),'start of month')
0                       2007-05-01

In [ ]:
max = '''select date(max(t.dt),'start of month') from client_transactions t'''

In [ ]:
select(max)

  date(max(t.dt),'start of month')
0                       2008-06-01

In [ ]:
sql = f'''WITH RECURSIVE dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
)
SELECT t.month FROM dates t'''

In [ ]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

теперь у нас есть все месяца. И теперь к этой табличке можно джоинить отчет. 

берем и создаем первую таблицу с помощью with, затем вторую trans_month, которую мы создали с транзакциями, но она потреяла сентябрь. логика: сначала генерируем даты, затем считаем транзакции на месяц, затем приджоиним, и выберем только два понял  cnt и amount_sum. И добавим сортировку по дате, а также нули вместо NaN.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),
trans_month as

(select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1
order by 1)


SELECT t.month,
coalesce(tm.transaction_cnt,0) as transaction_cnt,
coalesce(tm.amount_sum,0) as amount_sum

FROM dates t
left join trans_month tm on t.month = tm.month
order by t.month'''

In [ ]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-09-01                0        0.00
5   2007-10-01              332   634846.49
6   2007-11-01              389   500420.98
7   2007-12-01              364   561449.89
8   2008-01-01              413   630137.22
9   2008-02-01              228   337043.47
10  2008-03-01              309   425599.09
11  2008-04-01              383   677194.97
12  2008-05-01              310   474962.34
13  2008-06-01              271   383710.84

Прежду чем сгенерировать отчет, сначала нужно сделать даты, а затем уже сырой отчет приджоинить к датам. И увидим все полностью, со всеми пропусками и со всеми датами.

## Ежемесячный отчет на пользователя

Часто нам нужно посчитать сумму по месяцам на каждого пользователя или же на каждый год, а может за весь период. Это нужно для более детального отчета. И здесь нужно использовать точно такую тактику. Но здесь нужно сгенерировать не только даты, а даты на каждого пользователя. Первле, что нам нужно взять - это каждого пользователя. 

Всех пользователей мы сможем найти в таблице german_credit, и нужно отобрать только уникальных пользователей.

In [ ]:
sql = '''select distinct t.client_id from german_credit t'''

In [ ]:
select(sql)

     client_id
0          210
1          929
2          200
3           45
4          358
..         ...
995        624
996        181
997        730
998        557
999         23

[1000 rows x 1 columns]

в таблице с транзакциями не обязательно будут все пользователи, потому что там не будет тех пользователей, которые не совершают транзакции, а они могут у анс быть в базе. а нам нужно их учитывать. будем считать что в таблице german_credit хранится вообще весь список клиентов. 

Дальше мы можем добавить наших клиентов в with после сгенерированных дат следующей таблицей.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t)

select t.month from dates t'''

In [ ]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

теперь мы можем приджоинить всех пользоватей ко всем месяцам. Мы каждому клиенту добавили каждую дату. **M*N** 14 месяцев и 1000 пользователей. Итого 14000 строк.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t)

select t.month, c.client_id from dates t
join clients c on 1=1
'''

In [ ]:
select(sql)

            month  client_id
0      2007-05-01        210
1      2007-05-01        929
2      2007-05-01        200
3      2007-05-01         45
4      2007-05-01        358
...           ...        ...
13995  2008-06-01        624
13996  2008-06-01        181
13997  2008-06-01        730
13998  2008-06-01        557
13999  2008-06-01         23

[14000 rows x 2 columns]

Важный принцип: очень полезно выбрать какого-то пользователя и проверять на нем всю логику. Потому что на такую большую таблицу уже сложно смотреть. Например, мы выберем 929 пользователя.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t)

select t.month, c.client_id from dates t
join clients c on 1=1
where c.client_id=929
'''

In [ ]:
select(sql)

         month  client_id
0   2007-05-01        929
1   2007-06-01        929
2   2007-07-01        929
3   2007-08-01        929
4   2007-09-01        929
5   2007-10-01        929
6   2007-11-01        929
7   2007-12-01        929
8   2008-01-01        929
9   2008-02-01        929
10  2008-03-01        929
11  2008-04-01        929
12  2008-05-01        929
13  2008-06-01        929

Все верно, на 929 пользоателя созданы все 14 месяцев.

и мы предыдущий запрос переделываем в новую таблицу внутри with и селектим все ее строки.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t),

clients_month as
(select t.month, c.client_id from dates t
join clients c on 1=1)

select * from clients_month t
'''

In [ ]:
select(sql)

            month  client_id
0      2007-05-01        210
1      2007-05-01        929
2      2007-05-01        200
3      2007-05-01         45
4      2007-05-01        358
...           ...        ...
13995  2008-06-01        624
13996  2008-06-01        181
13997  2008-06-01        730
13998  2008-06-01        557
13999  2008-06-01         23

[14000 rows x 2 columns]

Следущий шаг: здесь мы уже можем джоинить информацию по транзакциям. Но перед тем как джоинить, нужно транзакции привести в ту же форму. На каждого пользователя должны быть посчитаны все транзакции на каждый месяц. Добавим еще одно поле группировки - клиента и в group by.

In [ ]:
sql = '''select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1,2
order by 1'''

In [ ]:
select(sql)

           month  client_id  transaction_cnt  amount_sum
0     2007-05-01        101                1      149.67
1     2007-05-01        107                2      217.50
2     2007-05-01        110                1     1081.32
3     2007-05-01        111                1      139.97
4     2007-05-01        113                1     1051.29
...          ...        ...              ...         ...
3551  2008-06-01        983                1    10050.37
3552  2008-06-01        987                1      192.48
3553  2008-06-01        992                1     -610.21
3554  2008-06-01        996                1      121.28
3555  2008-06-01        999                1     -641.25

[3556 rows x 4 columns]

Запрос показал что на каждого пользователя есть месяц, количество транзакций в месяц и общая сумма транзакций в месяц.

Теперь этот запрос мы можем добавить в CTE, чтобы собрать отчет. И к client_month мы можем приджоинить таблицу trans_month.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t),

clients_month as
(select t.month, c.client_id from dates t
join clients c on 1=1),

trans_month as
(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1,2
order by 1)

select t.*,
tm.transaction_cnt,
tm.amount_sum

from clients_month t
left join trans_month tm on t.client_id=tm.client_id
and t.month=tm.month
where t.client_id=929
'''

In [ ]:
select(sql)

         month  client_id  transaction_cnt  amount_sum
0   2007-05-01        929              1.0      156.40
1   2007-06-01        929              NaN         NaN
2   2007-07-01        929              NaN         NaN
3   2007-08-01        929              NaN         NaN
4   2007-09-01        929              NaN         NaN
5   2007-10-01        929              NaN         NaN
6   2007-11-01        929              NaN         NaN
7   2007-12-01        929              NaN         NaN
8   2008-01-01        929              NaN         NaN
9   2008-02-01        929              NaN         NaN
10  2008-03-01        929              1.0     1070.06
11  2008-04-01        929              1.0      138.79
12  2008-05-01        929              NaN         NaN
13  2008-06-01        929              NaN         NaN

И теперь мы видим все транзакции по клиенту 929. и по нему не так уж и много транзакций.  Это очень удобная тактика.

Можно посмотреть, сколько было активных клиентов каждый месяц.
Сделаем с помощью case when еще одно поле активности

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t),

clients_month as
(select t.month, c.client_id from dates t
join clients c on 1=1),

trans_month as
(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1,2
order by 1)

select t.*,
tm.transaction_cnt,
tm.amount_sum,
case when tm.transaction_cnt > 0 then 1 else 0 end as active

from clients_month t
left join trans_month tm on t.client_id=tm.client_id
and t.month=tm.month
'''

In [ ]:
select(sql)

            month  client_id  transaction_cnt  amount_sum  active
0      2007-05-01        210              1.0       68.84       1
1      2007-05-01        929              1.0      156.40       1
2      2007-05-01        200              NaN         NaN       0
3      2007-05-01         45              NaN         NaN       0
4      2007-05-01        358              NaN         NaN       0
...           ...        ...              ...         ...     ...
13995  2008-06-01        624              1.0      170.43       1
13996  2008-06-01        181              1.0      133.53       1
13997  2008-06-01        730              NaN         NaN       0
13998  2008-06-01        557              1.0       66.02       1
13999  2008-06-01         23              NaN         NaN       0

[14000 rows x 5 columns]

И это мы уже собираем в некий отчет (таблица client_trans_month), это некая витрина, где на каждую дату мы видим, что делал пользователь. И теперь уже можно делать сводник на основе этой большой таблице.

In [ ]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t),

clients_month as
(select t.month, c.client_id from dates t
join clients c on 1=1),

trans_month as
(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1,2
order by 1),

client_trans_month as
(select t.*,
tm.transaction_cnt,
tm.amount_sum,
case when tm.transaction_cnt > 0 then 1 else 0 end as active

from clients_month t
left join trans_month tm on t.client_id=tm.client_id
and t.month=tm.month)

select * from client_trans_month t
'''

In [ ]:
select(sql)

            month  client_id  transaction_cnt  amount_sum  active
0      2007-05-01        210              1.0       68.84       1
1      2007-05-01        929              1.0      156.40       1
2      2007-05-01        200              NaN         NaN       0
3      2007-05-01         45              NaN         NaN       0
4      2007-05-01        358              NaN         NaN       0
...           ...        ...              ...         ...     ...
13995  2008-06-01        624              1.0      170.43       1
13996  2008-06-01        181              1.0      133.53       1
13997  2008-06-01        730              NaN         NaN       0
13998  2008-06-01        557              1.0       66.02       1
13999  2008-06-01         23              NaN         NaN       0

[14000 rows x 5 columns]

Посчитаем месяц, сумму пользвоателей (создали отдельный столбец с единичками), сумму денег по месяцам, сумму активных пользователей по столбцу active. И группируем по месяцам.

In [ ]:
 sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as
(select distinct t.client_id from german_credit t),

clients_month as
(select t.month, c.client_id from dates t
join clients c on 1=1),

trans_month as 
(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by 1,2
order by 1),

client_trans_month as (
select t.*,
tm.transaction_cnt,
tm.amount_sum,
1 as user,
case when tm.transaction_cnt > 0 then 1 else 0 end as active

from clients_month t
left join trans_month tm on t.client_id = tm.client_id
and t.month = tm.month
)

select t.month,
sum(t.user) as user_cnt,
sum(t.amount_sum) as amount_sum , 
sum(t.active) as active_cnt

from client_trans_month t
group by t.month
'''

In [ ]:
select(sql)

         month  user_cnt  amount_sum  active_cnt
0   2007-05-01      1000   450912.77         288
1   2007-06-01      1000   551664.83         297
2   2007-07-01      1000   494134.50         259
3   2007-08-01      1000   426903.23         222
4   2007-09-01      1000         NaN           0
5   2007-10-01      1000   634846.49         283
6   2007-11-01      1000   500420.98         323
7   2007-12-01      1000   561449.89         287
8   2008-01-01      1000   630137.22         325
9   2008-02-01      1000   337043.47         204
10  2008-03-01      1000   425599.09         267
11  2008-04-01      1000   677194.97         301
12  2008-05-01      1000   474962.34         263
13  2008-06-01      1000   383710.84         237

Прежду чем такой отчет куда то отправлять, нужно обязательно проверить, а сходится ли сумма с сырыми данными.

Смотрим сырую сумму:

In [ ]:
sql = '''select sum(t.amount) from client_transactions t'''

In [ ]:
select(sql)

   sum(t.amount)
0     6548980.62

И теперь если мы сложим все знаечния в нашем отчете, то должно получиться столько же. сделаем это с помощью pandas. Сохраним отчет в таблицу t.

In [ ]:
t = select(sql)

In [ ]:
t

         month  user_cnt  amount_sum  active_cnt
0   2007-05-01      1000   450912.77         288
1   2007-06-01      1000   551664.83         297
2   2007-07-01      1000   494134.50         259
3   2007-08-01      1000   426903.23         222
4   2007-09-01      1000         NaN           0
5   2007-10-01      1000   634846.49         283
6   2007-11-01      1000   500420.98         323
7   2007-12-01      1000   561449.89         287
8   2008-01-01      1000   630137.22         325
9   2008-02-01      1000   337043.47         204
10  2008-03-01      1000   425599.09         267
11  2008-04-01      1000   677194.97         301
12  2008-05-01      1000   474962.34         263
13  2008-06-01      1000   383710.84         237

In [ ]:
t['amount_sum'].sum()

6548980.619999999

И только после того, как сделали такие проверки, посмотрели на контрольную сумму. И посмотрели глазами на несколько юзеров, проверив логику по id, только так можно убедиться что все хорошо. Чем больше проверок, тем лучше.

In [ ]:
2 * 365 * 10000

## Джойн таблицы самой на себя (нарастающий итог)

In [ ]:
t = pd.DataFrame({'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3]})

In [ ]:
t

          dt  revenue
0 2021-04-01        1
1 2021-04-02        2
2 2021-04-03        3

In [ ]:
t.to_sql('revenue',con,index=False,if_exists='replace')

Представим, что нужно посчитать нарастающий итог. И это можно сделать с помощью джоина таблицы самой на себя.  И к строке должно приджоиниваться все, что за строкой, все, что идет за ней. И можно использовать дату, чтобы это сделать.

In [ ]:
sql = '''select 
t.dt,t.revenue, sum(r.revenue) as cumsum from revenue t
join revenue r on r.dt <= t.dt 
group by t.dt, t.revenue'''

In [ ]:
select(sql)

                    dt  revenue  cumsum
0  2021-04-01 00:00:00        1       1
1  2021-04-02 00:00:00        2       3
2  2021-04-03 00:00:00        3       6

In [ ]:
table = pd.DataFrame({'dt':pd.to_datetime(['2021-08-01', '2021-08-02', '2021-08-03']), 'value':[4, 6, 12]})

In [ ]:
table

          dt  value
0 2021-08-01      4
1 2021-08-02      6
2 2021-08-03     12

In [ ]:
table.to_sql('table_test',con,index=False,if_exists='replace')

In [ ]:
sql = '''select 
t.dt, t.value, sum(tt.value) as cumsum

 from table_test t
join table_test tt on tt.value <= t.value
group by t.dt, t.value
'''

In [ ]:
select(sql)

                    dt  value  cumsum
0  2021-08-01 00:00:00      4       4
1  2021-08-02 00:00:00      6      10
2  2021-08-03 00:00:00     12      22

# Оконные функции

## Что такое оконная функция?

In [ ]:
sql = '''select t.*,
sum(t.revenue) over (order by t.dt) as cum_sum
from revenue t'''

In [ ]:
select(sql)

                    dt  revenue  cum_sum
0  2021-04-01 00:00:00        1        1
1  2021-04-02 00:00:00        2        3
2  2021-04-03 00:00:00        3        6

In [ ]:
t = pd.DataFrame({'user_id':[1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                                               '2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

In [ ]:
t

   user_id         dt  revenue
0        1 2021-04-01        1
1        1 2021-04-02        2
2        1 2021-04-03        3
3        2 2021-04-01        2
4        2 2021-04-02        3
5        2 2021-04-03        4

In [ ]:
t.to_sql('revenue',con,index=False,if_exists='replace')

Теперь мы хотим считать нарастающий итог по каждому пользователю. Потому что мы не может сложить revenue одного пользователя с revenue другого.

In [ ]:
sql = '''select t.*,
sum(t.revenue) over (partition by t.user_id order by t.dt) as cum_sum
from revenue t'''

In [ ]:
select(sql)

   user_id                   dt  revenue  cum_sum
0        1  2021-04-01 00:00:00        1        1
1        1  2021-04-02 00:00:00        2        3
2        1  2021-04-03 00:00:00        3        6
3        2  2021-04-01 00:00:00        2        2
4        2  2021-04-02 00:00:00        3        5
5        2  2021-04-03 00:00:00        4        9

## Rank и row_number

In [ ]:
t = pd.DataFrame({'user_id':[1,1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03','2021-04-03',
                                                               '2021-04-03','2021-04-04','2021-04-05'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,1,2,3,4]})

In [ ]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from revenue t'''

In [ ]:
select(sql)

   user_id                   dt  revenue
0        1  2021-04-01 00:00:00        1
1        1  2021-04-02 00:00:00        2
2        1  2021-04-03 00:00:00        3
3        1  2021-04-03 00:00:00        1
4        2  2021-04-03 00:00:00        2
5        2  2021-04-04 00:00:00        3
6        2  2021-04-05 00:00:00        4

In [ ]:
sql = '''select t.*,

rank() over (partition by t.user_id order by t.dt desc) as rnk

from revenue t'''

In [ ]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    1
2        1  2021-04-02 00:00:00        2    3
3        1  2021-04-01 00:00:00        1    4
4        2  2021-04-05 00:00:00        4    1
5        2  2021-04-04 00:00:00        3    2
6        2  2021-04-03 00:00:00        2    3

In [ ]:
sql = '''
with dt_rank as (
select t.*,
rank() over (partition by t.user_id order by t.dt desc) as rnk
from revenue t)

select * from dt_rank t
where t.rnk = 1
'''

In [ ]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    1
2        2  2021-04-05 00:00:00        4    1

In [ ]:
sql = '''select t.*,
row_number() over (partition by t.user_id order by t.dt desc) as rnk
from revenue t'''

In [ ]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    2
2        1  2021-04-02 00:00:00        2    3
3        1  2021-04-01 00:00:00        1    4
4        2  2021-04-05 00:00:00        4    1
5        2  2021-04-04 00:00:00        3    2
6        2  2021-04-03 00:00:00        2    3

In [ ]:
sql = '''
with dt_rank as (
select t.*,
row_number() over (partition by t.user_id order by t.dt desc) as rnk
from revenue t)
 
select * from dt_rank t
where t.rnk = 1
'''

In [ ]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        2  2021-04-05 00:00:00        4    1

In [ ]:
t = pd.DataFrame({'user_id':[1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                                               '2021-04-03','2021-04-04','2021-04-05'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

In [ ]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.user_id,
max(t.dt) as max_dt
from revenue t
group by t.user_id'''

In [ ]:
select(sql)

   user_id               max_dt
0        1  2021-04-03 00:00:00
1        2  2021-04-05 00:00:00

In [ ]:
sql = '''
with last_dt as (
select t.user_id,
max(t.dt) as max_dt
from revenue t
group by t.user_id)

select t.* from revenue t
join last_dt ld on t.user_id = ld.user_id
and t.dt = ld.max_dt
'''

In [ ]:
select(sql)

   user_id                   dt  revenue
0        1  2021-04-03 00:00:00        3
1        2  2021-04-05 00:00:00        4

## Топ 3 зарплаты в отделе

In [ ]:
t = pd.DataFrame({'dep':['a','a','a','a','a',
                         'b','b','b','b','b'],
                  'emp':['aa','bb','cc','dd','ee',
                         'aa','bb','cc','dd','ee'],
                  'sal':[5,5,3,2,1,
                         5,4,3,2,1]})

In [ ]:
t

  dep emp  sal
0   a  aa    5
1   a  bb    5
2   a  cc    3
3   a  dd    2
4   a  ee    1
5   b  aa    5
6   b  bb    4
7   b  cc    3
8   b  dd    2
9   b  ee    1

In [ ]:
t.to_sql('salary',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*,
dense_rank() over (partition by t.dep order by t.sal desc) as rnk
from salary t'''

In [ ]:
select(sql)

  dep emp  sal  rnk
0   a  aa    5    1
1   a  bb    5    1
2   a  cc    3    2
3   a  dd    2    3
4   a  ee    1    4
5   b  aa    5    1
6   b  bb    4    2
7   b  cc    3    3
8   b  dd    2    4
9   b  ee    1    5

In [ ]:
sql = '''select t.*,
rank() over (partition by t.dep order by t.sal desc) as rnk_rank,
dense_rank() over (partition by t.dep order by t.sal desc) as rnk

from salary t'''

In [ ]:
select(sql)

  dep emp  sal  rnk_rank  rnk
0   a  aa    5         1    1
1   a  bb    5         1    1
2   a  cc    3         3    2
3   a  dd    2         4    3
4   a  ee    1         5    4
5   b  aa    5         1    1
6   b  bb    4         2    2
7   b  cc    3         3    3
8   b  dd    2         4    4
9   b  ee    1         5    5

In [ ]:
sql = '''
with salary_rnk as (
select t.*,
dense_rank() over (partition by t.dep order by t.sal desc) as rnk
from salary t)
 
select * from salary_rnk t
where t.rnk <= 3
'''

In [ ]:
select(sql)

  dep emp  sal  rnk
0   a  aa    5    1
1   a  bb    5    1
2   a  cc    3    2
3   a  dd    2    3
4   b  aa    5    1
5   b  bb    4    2
6   b  cc    3    3

## Клиентские сессии

In [ ]:
user1 = pd.DataFrame({'user_id':[1,1,1,1,1],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 12:31',
                                       '2021-04-03 07:31'],format='%Y-%m-%d %H:%M')})

In [ ]:
user1

In [ ]:
user2 = pd.DataFrame({'user_id':[2,2,2,2],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 9:10',
                                       ],format='%Y-%m-%d %H:%M')})

In [ ]:
user3 = pd.DataFrame({'user_id':[3,3,3],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-02 07:35',
                                       '2021-04-03 08:20'
                                       ],format='%Y-%m-%d %H:%M')})

In [ ]:
t = pd.concat([user1,user2,user3])

In [ ]:
t

In [ ]:
t.to_sql('client_log',con,index=False,if_exists='replace')

In [ ]:
sql = '''select * from client_log t'''

In [ ]:
select(sql)

In [ ]:
24 * 60 * 60

In [ ]:
sql = '''
with new_session as (
select t.*,
lag(t.dt) over (partition by t.user_id order by t.dt) as prev_dt,
round((julianday(t.dt) - julianday(lag(t.dt) over (partition by t.user_id order by t.dt))) * 24 * 60 * 60) as dt_diff,
case when round((julianday(t.dt) - julianday(lag(t.dt) over (partition by t.user_id order by t.dt))) * 24 * 60 * 60) >= 3600
then 1 else 0 end as new_session

from client_log t),

client_sessions as (
select t.*,
sum(t.new_session) over (partition by t.user_id order by t.dt) as session_id
from new_session t),

client_sessions_agg as (
select t.user_id, t.session_id, count(1) as action_cnt from client_sessions t
group by t.user_id, t.session_id)

select count(*) from client_sessions_agg t
'''

In [ ]:
select(sql)

## Скользящее среднее

In [ ]:
t = pd.DataFrame({'user_id':[1,1,1,1,1,1,
                             2,2,2,2,2],
                  'dt':[1,2,3,4,5,6,
                        1,2,3,4,5],
                  'revenue':[1,2,3,4,5,6,
                             3,4,5,6,7]})

In [ ]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [ ]:
sql = '''select t.*,

avg(t.revenue) over (partition by t.user_id order by t.dt

rows between 2 preceding and current row

) as moving_avg

 from revenue t'''

In [ ]:
select(sql)